[Reward_Gatekeeper X2RewardTemplate]
DisplayName="Gatekeeper Unit"
RewardDetails="XCOM gets a Gatekeeper."

[GatekeeperClass X2SoldierClassTemplate]
+DisplayName="Gatekeeper"
+ClassSummary="A powerful psionic unit, on par with the pre-advent Ethereal"
+LeftAbilityTreeTitle="Gatekeeper"
+RightAbilityTreeTitle="Gatekeeper"
+AbilityTreeTitles[0]="Gatekeeper"
+AbilityTreeTitles[1]="Gatekeeper"
+AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Gatekeeper"
+RandomNickNames[1]="Zuriel"


[PA_GatekeeperGun X2WeaponTemplate]
FriendlyName="Gatekeeper Blaster"
BriefSummary="Gatekeeper Blaster"
TacticalText="<Bullet/> Gatekeeper Blaster. <Bullet/> Not usable by human soldiers -- it's a part of them !"
AbilityDescName="Gatekeeper Blaster"

[PA_Gatekeeper_Tech X2TechTemplate]
DisplayName="Restoring a Gatekeeper"
Summary="We could use their enormous psionic output to reanimate the shell and with the help of Chief Engineer Shen, we could create our own version of a Gatekeeper."
CodeName="Tentakles"
LongDescript="The gatekeeper restoration was a sucess"

[XGCharacterGenerator_Gatekeeper]
JunkSparkFirstName="Gatekeeper"
JunkSparkLastNamePrefix="000"

[PA_Domination X2AbilityTemplate]
LocFriendlyName="2one Domination"
LocLongDescription="Permanently mind control an enemy in a zone. Only <Ability:Domination_Charge_Tag/> successful Domination attack can be performed per mission."
LocHelpText="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocFlyOverText="Domination"
LocMissMessage="Domination Failed"
LocPromotionPopupText="<Bullet/> Domination requires a contest of the Gatekeeper's Psi Strength stat versus the Will of the target.<br/><Bullet/> If an attempted Domination fails, there is a <Ability:Domination_coolDown_Tag/> turn coldown before another Domination can be attempted.<br/><Bullet/> If the Gatekeeper dies or leaves the battlefield, the Domination is broken.<br/>"


[PA_AnimaGate X2AbilityTemplate]
LocFriendlyName="Fire Beam"
LocLongDescription="By opening a miniature gateway and focusing the released energy, a Gatekeeper can project destructive force at extreme range."
LocHelpText="Fire a beam of focused energy at a target."

[PA_AnimaConsume X2AbilityTemplate]
LocFriendlyName="Consume"
LocLongDescription="The touch of a Gatekeeper may consume the life of a nearby unit, healing itself while causing severe damage. If the target is slain by this attack, it may be reanimated as a psi zombie."
LocHelpText="Drain the life of a humanoid target at melee range, raising it as a Psi Zombie if it is killed."
LocFlyOverText="Consume"

[PA_AnimaInversion X2AbilityTemplate]
LocFriendlyName="Gateway"
LocLongDescription="Open a devastating psionic rift in an area. Any humanoid enemies killed can be raised as psionic zombies."
LocHelpText="Open a devastating psionic rift in an area. Any humanoid enemies killed can be raised as psionic zombies."

[PA_Retract X2AbilityTemplate]
LocFriendlyName="Retract"
LocLongDescription="If an open Gatekeeper is hit by an attack and takes damage, it is likely to retract into its shell."
LocHelpText="The Gatekeeper retracts its defensive shell when damaged."
LocFlyOverText="Retract"

[PA_GatekeeperOpen X2AbilityTemplate]
LocFriendlyName="Open Shell"
LocLongDescription="Open the Gatekeeper's shell, reducing armor but granting access to additional abilities."
LocHelpText="Open the Gatekeeper's shell, reducing armor but granting access to additional abilities."
LocFlyOverText="Open Shell"

[PA_GatekeeperClose X2AbilityTemplate]
LocFriendlyName="Close Shell"
LocLongDescription="Close the Gatekeeper's shell, increasing armor but preventing the use of some abilities."
LocHelpText="Close the Gatekeeper's shell, increasing armor but preventing the use of some abilities."
LocFlyOverText="Close Shell"

[GatekeeperClosedEffect X2AbilityTemplate]
LocFriendlyName="Armored Shell"
LocLongDescription="The Gatekeeper's shell is closed. It is more resistant to damage."
LocHelpText="The Gatekeeper gains armor and defensive bonuses when its outer shell is closed."
LocFlyOverText="Armored Shell"

[PA_ProtectiveShell X2AbilityTemplate]
LocFriendlyName="Protective Shell"
LocLongDescription="When a Gatekeeper's shell is closed, it is extremely resistant to damage but has only limited offensive options."
LocHelpText="When a Gatekeeper's shell is closed, it is extremely resistant to damage but has only limited offensive options."
LocFlyOverText="Protective Shell"


PA_GatekeeperClosedEffectName="Closed State"
PA_GatekeeperClosedEffectDesc="The Gatekeeper's shell is closed. It is more resistant to damage in this state."